uhnp/src/DataProcessors/тн_СверкаДокументов_УПП_ЕРП_Удалить/тн_СверкаДокументов_УПП_ЕРП_Удалить.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_СверкаДокументов_УПП_ЕРП_Удалить</name>
  <comment>№000046536</comment>
  <tabularSections>
    <name>НастройкиСверки</name>
    <attributes>
      <name>ТипУПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЕРП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/тн_ЗагруженныеОбъекты/тн_ЗагруженныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ЗагруженныеОбъекты</name>
  <comment>№000037864</comment>
  <resources>
    <name>РазрешитьРедактирование</name>
    <comment>Выполнение задач №000040623</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Версия</name>
    <comment>№000045229</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/тн_РежимыВИнтеграционнойСхеме/тн_РежимыВИнтеграционнойСхеме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_РежимыВИнтеграционнойСхеме</name>
  <comment>Выполнение задач №000046497</comment>
  <enumValues>
    <name>Промежуточный</name>
  </enumValues>
  <enumValues>
    <name>Учетный</name>
  </enumValues>
  <enumValues>
    <name>Давальческий</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/тн_СверкаДокументов_УПП_ЕРП_Удалить/Forms/ФормаУФ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СКД 				= РеквизитФормыВЗначение("Объект").ПолучитьМакет("Сверка");
	АдресВХ 			= ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	ИсточникНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(АдресХранилища)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВремИмяФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ВремИмяФайла);
	
	ТабличныйДокументРезультат = Новый ТабличныйДокумент;
	ТабличныйДокументРезультат.Прочитать(ВремИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокументРезультат.Область(4,2, ТабличныйДокументРезультат.ВысотаТаблицы, ТабличныйДокументРезультат.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаЗначений = Построитель.Результат.Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(10, 0);
	
	ТаблицаЗначений.Колонки.Добавить("СсылкаЕРП"); 
	ТаблицаЗначений.Колонки.Добавить("ПроведенУПП", Новый ОписаниеТипов("Булево"));
	ТаблицаЗначений.Колонки.Добавить("ПометкаУдаленияУПП", Новый ОписаниеТипов("Булево")); 
	ТаблицаЗначений.Колонки.Добавить("ЭтоДокумент", Новый ОписаниеТипов("Булево"));
	ТаблицаЗначений.Колонки.Добавить("КоличествоДокументовУПП", Новый ОписаниеТипов("Число",,, КвалификаторЧисла));
	ТаблицаЗначений.Колонки.Добавить("КоличествоДокументовЕРП", Новый ОписаниеТипов("Число",,, КвалификаторЧисла));
	// НАЧАЛО Белоконенко Денис 26.11.2024 Выполнение задач №000051812 
	ТаблицаЗначений.Колонки.Добавить("УУ_УПП", Новый ОписаниеТипов("Булево"));
	ТаблицаЗначений.Колонки.Добавить("БУ_УПП", Новый ОписаниеТипов("Булево"));
	ТаблицаЗначений.Колонки.Добавить("НУ_УПП", Новый ОписаниеТипов("Булево"));
	// КОНЕЦ Белоконенко Денис 26.11.2024 Выполнение задач №000051812
	
	// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
	МассивВсехТиповДокументов = Новый Массив;
	// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486	
	
	// НАЧАЛО Белоконенко Денис 04.04.2024 Выполнение задач №000049116
	//Для Каждого Стр Из ТаблицаЗначений Цикл
	Для Сч = 0 По ТаблицаЗначений.Количество() - 1 Цикл
		Стр = ТаблицаЗначений[Сч];
	// КОНЕЦ Белоконенко Денис 04.04.2024 Выполнение задач №000049116	
		
		Если ПустаяСтрока(Стр[0]) Тогда
			ТаблицаЗначений.Удалить(Стр);
			Продолжить;
		КонецЕсли;
		
		// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
		Если ЗначениеЗаполнено(Стр.СсылкаЕРП) Тогда
			Продолжить;
		КонецЕсли; 
		
		ОтборПоОрганизациям = Стр.ОтборОрганизации;
		ОтборПоДате = Стр.ОтборДата;
		// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486		
		
		Стр.КоличествоДокументовУПП = 1;
		
		Если Стр.Проведен = "Да" Тогда
			Стр.ПроведенУПП = Истина;
		Иначе
			Стр.ПроведенУПП = Ложь;
		КонецЕсли;
		
		Если Стр.ПометкаУдаления = "Да" Тогда
			Стр.ПометкаУдаленияУПП = Истина;
		Иначе
			Стр.ПометкаУдаленияУПП = Ложь;
		КонецЕсли; 
		
		// НАЧАЛО Белоконенко Денис 26.11.2024 Выполнение задач №000051812
		ЗаполнитьРеквизитыУчета(Стр);
		// КОНЕЦ Белоконенко Денис 26.11.2024 Выполнение задач №000051812
		
		ТекущаяСсылка = Неопределено;
		ТекущийТип = "";
		
		Если СтрНайти(Стр.ТипЕРП, "Справочник.") > 0 Тогда
			ТекущийТип = СтрЗаменить(Стр.ТипЕРП, "Справочник.", "");
			
			МассивТипов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийТип, ";", Истина);
			
			Для Каждого СтрТип Из МассивТипов Цикл
				Если ТекущаяСсылка = Неопределено Или Не ОбщегоНазначения.СсылкаСуществует(ТекущаяСсылка) Тогда
					ТекущаяСсылка = Справочники[СтрТип].ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.ГУИД_УПП));
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли СтрНайти(Стр.ТипЕРП, "Документ.") > 0 Тогда
			Стр.ЭтоДокумент = Истина;
			ТекущийТип = СтрЗаменить(Стр.ТипЕРП, "Документ.", "");
			
			МассивТипов 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийТип, ";", Истина);
			МассивВариантовСверки 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр.ВариантСверки, ";", Истина);
			
			// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
			МассивСсылок = Новый Массив;
			// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486
			Индекс = 0;
			Для Каждого СтрТип Из МассивТипов Цикл
				// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
				//Если ТекущаяСсылка = Неопределено Или Не ОбщегоНазначения.СсылкаСуществует(ТекущаяСсылка) Тогда
				// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486
					Если МассивВариантовСверки[Индекс] = "ПоНомеруДате" Тогда 
						// Поиск по номеру			                                       
						ТекущаяСсылка = Документы[СтрТип].НайтиПоНомеру(СокрЛП(Стр.Номер), Дата(Стр.Дата));	
					ИначеЕсли МассивВариантовСверки[Индекс] = "ГУИД" Тогда // Стандартный поиск по гуиду	
						ТекущаяСсылка = Документы[СтрТип].ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.ГУИД_УПП));
					КонецЕсли;
				// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
				//КонецЕсли; 
				МассивСсылок.Добавить(ТекущаяСсылка);
				// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486
				
				Индекс = Индекс + 1;
				// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
				МассивВсехТиповДокументов.Добавить(СтрТип);
				// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486
			КонецЦикла;
		КонецЕсли;
		
		// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
		//Если ОбщегоНазначения.СсылкаСуществует(ТекущаяСсылка) Тогда
		//	Стр.СсылкаЕРП = ТекущаяСсылка;
		//	Стр.КоличествоДокументовЕРП = 1;
		//КонецЕсли;

		Количество = 0;
		Для Каждого ТекущаяСсылка Из МассивСсылок Цикл
			// НАЧАЛО Белоконенко Денис 08.07.2024 Выполнение задач №000050146
			//Количество = Количество + 1;
			//Если ОбщегоНазначения.СсылкаСуществует(ТекущаяСсылка) Тогда 
			Если ОбщегоНазначения.СсылкаСуществует(ТекущаяСсылка) Тогда
				Количество = Количество + 1;			
			// КОНЕЦ Белоконенко Денис 08.07.2024 Выполнение задач №000050146
				Если Количество = 1 Тогда
					Стр.СсылкаЕРП = ТекущаяСсылка;
					Стр.КоличествоДокументовЕРП = 1; 
				Иначе
					НовСтрока = ТаблицаЗначений.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
					
					Стр.СсылкаЕРП = ТекущаяСсылка;
					Стр.КоличествоДокументовЕРП = 1;
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486 
				
	КонецЦикла;	
	
	// НАЧАЛО Белоконенко Денис 14.02.2024 Выполнение задач №000048486
	МассивВсехТиповДокументов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВсехТиповДокументов);
	ДополнитьТаблицуДокументамиERP(ТаблицаЗначений, МассивВсехТиповДокументов, ОтборПоОрганизациям, ОтборПоДате);
	// КОНЕЦ  Белоконенко Денис 14.02.2024 Выполнение задач №000048486	
	// НАЧАЛО Белоконенко Денис 26.11.2024 Выполнение задач №000051812
	ЗаменитьСсылкиERP(ТаблицаЗначений);
	// КОНЕЦ Белоконенко Денис 26.11.2024 Выполнение задач №000051812
	
	ВывестиОтчетНаФорму(ТаблицаЗначений);
КонецПроцедуры

&НаСервере
Процедура ВывестиОтчетНаФорму(ТаблицаЗначений)
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	СхемаКомпоновкиДанных = ЭтаОбработка.ПолучитьМакет("Сверка");
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровкиОтчета);
	
	ВнешнийНаборДанных = Новый Структура("ТЗ_Данные", ТаблицаЗначений);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровкиОтчета);
	
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОтчета, Новый УникальныйИдентификатор);
	
	ТабличныйДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры

&НаКлиенте
Процедура Сверка(Команда)
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	ЗагрузитьНаСервере(АдресХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыборФайла", ЭтаФорма);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "(*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныеФайлы = Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка);
	
	ПоказатьЗначение(Неопределено, ЗначениеРасшифровки);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка)
	ДанныеРасшифровкиКомпоновки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЗначенияПолей = ДанныеРасшифровкиКомпоновки.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	Если ЗначенияПолей.Количество() > 0 Тогда
		Возврат ЗначенияПолей[0].Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

// Белоконенко Денис 14.02.2024 Выполнение задач №000048486
&НаСервере
Процедура ДополнитьТаблицуДокументамиERP(ТЗ, МассивВсехТиповДокументов, ОтборПоОрганизациям, ОтборПоДате)
	МассивОрганизаций = Новый Массив;
	
	МассивОтборПоОрганизациям = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОтборПоОрганизациям, ";", Истина);
	Для Каждого Стр Из МассивОтборПоОрганизациям Цикл
		Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр));
		МассивОрганизаций.Добавить(Организация);
	КонецЦикла;
	
	ЕстьОтборПоОрганизациям = Ложь;
	Если МассивОрганизаций.Количество() > 0 Тогда
		ЕстьОтборПоОрганизациям = Истина;		
	КонецЕсли;
	
	МассивОтборПоДате = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОтборПоДате, ";", Истина);
	ДатаНач = ТекущаяДата();
	ДатаКон = ТекущаяДата();
	
	Если МассивОтборПоДате.Количество() = 2 Тогда
		ДатаНач = НачалоДня(Дата(МассивОтборПоДате[0]));
		ДатаКон = КонецДня(Дата(МассивОтборПоДате[1]));
	КонецЕсли; 
	
	МассивДокументовИсключений = ТЗ.ВыгрузитьКолонку("СсылкаЕРП");
	МассивДокументовИсключений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДокументовИсключений);
	
	Запрос = Новый Запрос;
	Тексты = Новый Массив;
	
	Для Каждого СтрокаТипа Из МассивВсехТиповДокументов Цикл
		
		ТекТип = "Документ." + СтрокаТипа;
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ТекТип);
		Если МетаданныеОбъекта = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найден объект метаданных в системе: " + ТекТип);
			Продолжить;
		КонецЕсли;;
		
		ТекстЗапроса = "";
		
		МассивРеквизитов = Новый Массив;
		
		ТекстРеквизиты = "ВЫБРАТЬ
						|	ОбъектМетаданных.Ссылка КАК СсылкаЕРП,
						|	ОбъектМетаданных.Проведен КАК Проведен,
						|	ОбъектМетаданных.Номер КАК Номер,
						|	ОбъектМетаданных.Дата КАК Дата,
						|	ОбъектМетаданных.Организация КАК Организация,";
		
		МассивРеквизитов.Добавить(ТекстРеквизиты);	
		
		ТекстЗапроса = СтрСоединить(МассивРеквизитов);
		
		ТекстЗапроса = ТекстЗапроса + СтрШаблон("
			|	""%1"" КАК ТипЕРП
			|ИЗ
			|	%1 КАК ОбъектМетаданных",
			ТекТип);
			
		// НАЧАЛО Белоконенко Денис 08.07.2024 Выполнение задач №000050146
		ТекстЗапроса = ТекстЗапроса + "
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.тн_ЗагруженныеОбъекты КАК тн_ЗагруженныеОбъекты
			|		ПО ОбъектМетаданных.Ссылка = тн_ЗагруженныеОбъекты.Объект";	
		// КОНЕЦ Белоконенко Денис 08.07.2024 Выполнение задач №000050146
		
		ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ 
			|	ОбъектМетаданных.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И ОбъектМетаданных.Ссылка НЕ В (&МассивДокументовИсключений)";
		
		Если ЕстьОтборПоОрганизациям Тогда
			ТекстЗапроса = ТекстЗапроса + "
				|	И ОбъектМетаданных.Организация В (&МассивОрганизаций)";
		КонецЕсли;
				
		Тексты.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ТекстЗапросаОбщий = СтрСоединить(Тексты, РазделительОбъединить());
		
	Запрос.Текст = ТекстЗапросаОбщий;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("МассивДокументовИсключений", МассивДокументовИсключений);
	//НАЧАЛО Блинова М.А. 23.11.2025 Выполнение задач №000055916  
	Запрос.Текст = тн_ОбщегоНазначения.СделатьЗапросРазрешенным(Запрос.Текст);
	//КОНЕЦ Блинова М.А. 23.11.2025 Выполнение задач №000055916

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ТипУПП = "Не сопоставленные";
		НоваяСтрока.КоличествоДокументовЕРП = 1;
		НоваяСтрока.КоличествоДокументовУПП = 0;
		НоваяСтрока.ЭтоДокумент = Истина;
	КонецЦикла; 
	
КонецПроцедуры

// Белоконенко Денис 14.02.2024 Выполнение задач №000048486
Функция РазделительОбъединить()
	Возврат	"
		|ОБЪЕДИНИТЬ ВСЕ
		|";
КонецФункции

// Белоконенко Денис 26.11.2024 Выполнение задач №000051812
&НаСервере
Процедура ЗаполнитьРеквизитыУчета(Стр)
	
	МассивВидовУчета = Новый Массив;
	МассивВидовУчета.Добавить("УУ");
	МассивВидовУчета.Добавить("БУ");
	МассивВидовУчета.Добавить("НУ");
	
	Для Каждого ВидУчета Из МассивВидовУчета Цикл
		Если Стр[ВидУчета] = "Да" Тогда
			Стр["" + ВидУчета + "_УПП"] = Истина;
		Иначе
			Стр["" + ВидУчета + "_УПП"] = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Белоконенко Денис 26.11.2024 Выполнение задач №000051812
&НаСервере
Процедура ЗаменитьСсылкиERP(ТЗ)
	
	МассивЗаменяемыхСсылок = Новый Массив;
		
	Для Каждого Стр Из ТЗ Цикл
		Если ТипЗнч(Стр.СсылкаЕРП) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
			МассивЗаменяемыхСсылок.Добавить(Стр.СсылкаЕРП);	
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоБезЗаказа.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт_ЗаменяемыеСсылки
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
		|ГДЕ
		|	ПроизводствоБезЗаказа.Ссылка В(&МассивЗаменяемыхСсылок)
		|	И ПроизводствоБезЗаказа.тн_РежимВИнтеграционнойСхеме = ЗНАЧЕНИЕ(Перечисление.тн_РежимыВИнтеграционнойСхеме.Промежуточный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ЗаменяемыеСсылки.Ссылка КАК СсылкаЗамены,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт_ДокументыЗамены
		|ИЗ
		|	вт_ЗаменяемыеСсылки КАК вт_ЗаменяемыеСсылки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
		|		ПО вт_ЗаменяемыеСсылки.Ссылка = ПроизводствоБезЗаказаВыходныеИзделия.тн_ПромежуточныйДокумент
		|ГДЕ
		|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.тн_РежимВИнтеграционнойСхеме = ЗНАЧЕНИЕ(Перечисление.тн_РежимыВИнтеграционнойСхеме.Учетный)
		|	И НЕ ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_ЗаменяемыеСсылки.Ссылка,
		|	ПроизводствоБезЗаказаПобочныеИзделия.Ссылка
		|ИЗ
		|	вт_ЗаменяемыеСсылки КАК вт_ЗаменяемыеСсылки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ПобочныеИзделия КАК ПроизводствоБезЗаказаПобочныеИзделия
		|		ПО вт_ЗаменяемыеСсылки.Ссылка = ПроизводствоБезЗаказаПобочныеИзделия.тн_ПромежуточныйДокумент
		|ГДЕ
		|	ПроизводствоБезЗаказаПобочныеИзделия.Ссылка.тн_РежимВИнтеграционнойСхеме = ЗНАЧЕНИЕ(Перечисление.тн_РежимыВИнтеграционнойСхеме.Учетный)
		|	И НЕ ПроизводствоБезЗаказаПобочныеИзделия.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_ЗаменяемыеСсылки.Ссылка,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка
		|ИЗ
		|	вт_ЗаменяемыеСсылки КАК вт_ЗаменяемыеСсылки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ПроизводствоБезЗаказаМатериалыИРаботы
		|		ПО вт_ЗаменяемыеСсылки.Ссылка = ПроизводствоБезЗаказаМатериалыИРаботы.тн_ПромежуточныйДокумент
		|ГДЕ
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка.тн_РежимВИнтеграционнойСхеме = ЗНАЧЕНИЕ(Перечисление.тн_РежимыВИнтеграционнойСхеме.Учетный)
		|	И НЕ ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДокументыЗамены.СсылкаЗамены КАК СсылкаЗамены,
		|	вт_ДокументыЗамены.Ссылка КАК Ссылка
		|ИЗ
		|	вт_ДокументыЗамены КАК вт_ДокументыЗамены
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ДокументыЗамены.СсылкаЗамены,
		|	вт_ДокументыЗамены.Ссылка";
	
	Запрос.УстановитьПараметр("МассивЗаменяемыхСсылок", МассивЗаменяемыхСсылок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокиТЗ = ТЗ.НайтиСтроки(Новый Структура("СсылкаЕРП", Выборка.СсылкаЗамены));
		Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
			СтрокаТЗ.СсылкаЕРП = Выборка.Ссылка;	
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры
